Repository: AmmarHabib122/Monkey-Mania
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: English
ar: إنجليزي

source: Arabic
ar: عربي

source: CSV file is empty or invalid
ar: ملف CSV فارغ أو غير صالح

source: Invalid Branch id
ar: ID فرع غير صالح

source: Phone number must contain only digits.
ar: يجب أن يحتوي رقم الهاتف على أرقام فقط.

source: Phone number must be exactly 11 digits long.
ar: يجب أن يكون رقم الهاتف بالضبط 11 رقمًا.

source: Start date cannot be bigger than the end date
ar: لا يمكن أن يكون تاريخ البدء أكبر من تاريخ الانتهاء

source: Start and End dates must be provided together
ar: يجب توفير تواريخ البدء والنهاية معًا

source: Csv file must be provided
ar: يجب توفير ملف CSV

source: The file provided must be in .csv format
ar: يجب أن يكون الملف المقدم في فورمات .csv

source: Wrong column format, The correct Format is {required_columns}
ar: تنسيق العمود الخاطئ ، التنسيق الصحيح هو {required_columns}

source: Only True or False are allowed for is_csv_response parameter
ar: يسمح فقط صحيح أو خطأ بمعلمة IS_CSV_RESPONSE

source: User is not logged in
ar: لم يتم تسجيل الدخول للمستخدم

source: You Do not have the permission to perform this action
ar: ليس لديك إذن لأداء هذا الإجراء

source: This User is not active any more
ar: هذا المستخدم لم يعد نشطًا

source: Logged in successfully
ar: تسجيل الدخول بنجاح

source: Invalid child ID.
ar: ID الطفل غير صالح.

source: You must provide a valid child ID.
ar: يجب عليك توفير ID طفل صالح.

source: child must be identified by an integer ID.
ar: يجب تحديد الطفل من خلال ID عدد صحيح.

source: Invalid branch ID.
ar: ID فرع غير صالح.

source: You must provide a valid branch ID.
ar: يجب عليك توفير ID فرع صالح.

source: branch must be identified by an integer ID.
ar: يجب تحديد الفرع بواسطة ID عدد صحيح.

source: You Do Not have the permission to access this data
ar: ليس لديك إذن للوصول إلى هذه البيانات

source: cash can not be negative
ar: لا يمكن أن يكون الكاش عدد سلبي

source: instapay can not be negative
ar: لا يمكن أن يكون انستاباي عدد سلبي

source: visa can not be negative
ar: لا يمكن أن تكون الفيزا عدد سلبي

source: Couldn't find a discount available to this branch with the given credentials.
ar: لا يمكن العثور على خصم متاح لهذا الفرع مع البيانات المرسلة.

source: Time Price can not be negative
ar: لا يمكن أن يكون سعر الوقت عدد سلبي

source: You do not have the permission to set the bill Time Price
ar: ليس لديك إذن لتحديد سعر وقت الفاتورة

source: Cafe Price can not be negative
ar: لا يمكن أن يكون سعر المقهى عدد سالب

source: You do not have the permission to set the bill Cafe Price
ar: ليس لديك إذن لتعيين سعر فاتورة الكافيه

source: You can not create a bill with a different branch
ar: لا يمكنك إنشاء فاتورة مع فرع مختلف

source: Children list can not be empty
ar: لا يمكن أن تكون قائمة الأطفال فارغة

source: Child {name} is currently registered in another bill
ar: الطفل {name} مسجل حاليًا في فاتورة أخرى

source: You tried to add the same child more than once
ar: حاولت إضافة نفس الطفل أكثر من مرة

source: Subscription bill cannot have more than one child
ar: لا يمكن أن يكون فاتورة الاشتراك أكثر من طفل

source: The Child {name} has no current active subscription
ar: لا يوجد لدى الطفل {name} اشتراك نشط حاليًا

source: The Child {name} is not allowed to visit this branch
ar: لا يُسمح للطفل {name} بزيارة هذا الفرع

source: There is no hour prices found for {children_count} children in this branch.
ar: لا توجد أسعار ساعة موجودة للأطفال {children_count} في هذا الفرع.

source: The bill is already closed
ar: الفاتورة مغلقة بالفعل

source: You can not close a bill from a different branch
ar: لا يمكنك إغلاق فاتورة من فرع مختلف

source: Total price does not equal the money client paid
ar: إجمالي السعر لا يساوي المال الذي دفعه العميل

source: Children-Count can not be negative or equal to zero
ar: لا يمكن أن يكون عدد الأطفال عدد سلبي أو يساوي الصفر

source: Hour-Price can not be negative or equal to zero
ar: لا يمكن أن يكون سعر الساعة عدد سلبي أو يساوي الصفر

source: Half-Hour-Price can not be negative or equal to zero
ar: لا يمكن أن يكون سعر نصف ساعة عدد سلبي أو يساوي الصفر

source: Age can not be negative or equal to zero
ar: لا يمكن أن يكون العمر عدد سلبي أو يساوي الصفر

source: You can only set a user with a manager role or higher to the branch manager field.
ar: يمكنك فقط تعيين مستخدم له دور المدير أو أعلى إلى حقل مدير الفرع.

source: Allowed Delay Minutes can not be negative or equal to zero
ar: لا يمكن أن تكون دقائق التأخير المسموح بها سالبة أو تساوي الصفر

source: Delay Interval Minutes for the Fine can not be negative or equal to zero
ar: لا يمكن أن تكون دقائق التأخير الفاصلة للغرامة سالبة أو تساوي الصفر

source: Delay Fine value must be between zero and 5 days
ar: يجب أن تكون قيمة غرامة التأخير بين الصفر و 5 أيام

source: Each children count must be unique per branch.
ar: يجب أن يكون عدد الأطفال فريدًا لكل فرع.

source: You can not set a user from another branch to be the manager of this branch.
ar: لا يمكنك تعيين مستخدم من فرع آخر ليكون مدير هذا الفرع.

source: Invalid school ID.
ar: ID المدرسة غير صالح.

source: You must provide a valid school ID.
ar: يجب عليك تقديم ID مدرسة صالح.

source: school must be identified by an integer ID.
ar: يجب تحديد المدرسة من خلال ID عدد صحيح.

source: You Do Not have the permission to perform this action.
ar: ليس لديك إذن لأداء هذا الإجراء.

source: Birth-Date can not be in the future.
ar: لا يمكن أن يكون تاريخ الميلاد في المستقبل.

source: Each Phone-number must be unique per child.
ar: يجب أن يكون كل رقم هاتف فريدًا لكل طفل.

source: Child Phone Numbers must be provided.
ar: يجب توفير أرقام هواتف الطفل.

source: You Do Not have the permission to delete all Child numbers.
ar: ليس لديك إذن لحذف جميع أرقام الأطفال.

source: Discount value can not be negative
ar: لا يمكن أن تكون قيمة الخصم عدد سلبي

source: Branches list can not be empty
ar: لا يمكن أن تكون قائمة الفروع فارغة

source: You tried to add the same branch more than once
ar: حاولت إضافة نفس الفرع أكثر من مرة

source: Discount allowed types are {allowed_values}.
ar: أنواع الخصم المسموح بها هي {allowed_values}.

source: Expire-Date must be in the future.
ar: يجب أن يكون انتهاء الصلاحية في المستقبل.

source: Discount value for percentage type must be between 0 and 1
ar: يجب أن تكون قيمة الخصم لنوع النسبة المئوية بين 0 و 1

source: price can not be negative
ar: لا يمكن أن يكون السعر عدد سلبي

source: quantity can not be negative or equal to zero
ar: لا يمكن أن تكون الكمية عدد سلبي أو تساوي الصفر

source: You can not add a general expense to a different branch
ar: لا يمكنك إضافة مصروفات عامة إلى فرع مختلف

source: Invalid material ID.
ar: ID الخامات غير صالح.

source: You must provide a valid material ID.
ar: يجب عليك توفير ID خامات صالح.

source: material must be identified by an integer ID.
ar: يجب تحديد الخامات بواسطة ID عدد صحيح.

source: You can not add a material expense to a different branch
ar: لا يمكنك إضافة مصروفات خامات إلى فرع مختلف

source: Branch must be identified by an integer ID.
ar: يجب تحديد الفرع بواسطة ID عدد صحيح.

source: You Can not access a Material from another branch
ar: لا يمكنك الوصول إلى خامات من فرع آخر

source: Quantity can not be negative.
ar: الكمية لا يمكن أن تكون عدد سلبي.

source: You can not add a material to a differnet branch
ar: لا يمكنك إضافة خامات إلى فرع مختلف

source: Invalid product ID.
ar: ID المنتج غير صالح.

source: You must provide a valid product ID.
ar: يجب عليك توفير ID منتج صالح.

source: Product must be identified by an integer ID.
ar: يجب تحديد المنتج بواسطة ID عدد صحيح.

source: Quantity cannot be less than one
ar: لا يمكن أن تكون الكمية أقل من واحد

source: Invalid offer ID.
ar: ID عرض غير صالح.

source: You must provide a valid offer ID.
ar: يجب عليك تقديم ID عرض صالح.

source: offer must be identified by an integer ID.
ar: يجب تحديد العرض بواسطة ID عدد صحيح.

source: Offer Price can not be negative.
ar: لا يمكن أن يكون سعر العرض عدد سلبي.

source: Expire date must be in the future
ar: يجب أن يكون تاريخ انتهاء صلاحية في المستقبل

source: You can not add an offer to this branch
ar: لا يمكنك إضافة عرض إلى هذا الفرع

source: At least one product must be provided.
ar: يجب توفير منتج واحد على الأقل.

source: Duplicate products are not allowed.
ar: المنتجات المكررة غير مسموح بها.

source: Invalid product type. Allowed values: product, offer.
ar: نوع المنتج غير صالح. القيم المسموح بها: المنتج ، العرض.

source: Invalid product type or ID
ar: نوع المنتج غير صالح أو ID

source: Invalid bill ID.
ar: ID فاتورة غير صالح.

source: You must provide a valid bill ID.
ar: يجب عليك تقديم ID فاتورة صالح.

source: bill must be identified by an integer ID.
ar: يجب تحديد الفاتورة بواسطة ID عدد صحيح.

source: table-number can not be negative
ar: لا يمكن أن يكون رقم الجدول عدد سلبي

source: total-price can not be negative
ar: لا يمكن أن يكون إجمالي السعر عدد سلبي

source: You do not have the permission to set the bill price
ar: ليس لديك إذن لتعيين سعر الفاتورة

source: At least one added item must be provided
ar: يجب توفير عنصر واحد على الأقل إضافي

source: Invalid item data
ar: بيانات عنصر غير صالحة

source: {product} does not belong to branch {branch}
ar: {product} لا ينتمي إلى فرع {branch}

source: Duplicate added items detected
ar: تم اكتشاف عناصر مكررة

source: At least one returned item must be provided
ar: يجب توفير عنصر واحد على الأقل

source: {product} does not belong to bill's branch {branch}
ar: {product} لا ينتمي إلى فرع Bill {branch}

source: Duplicate returned items detected
ar: تم اكتشاف العناصر التي تم إرجاعها مكررة

source: {name} has only {available} units
ar: {name} لديه وحدات {available} فقط

source: {product} in offer {offer} has only {available} units available
ar: {product} في العرض {offer} يحتوي فقط على {available} وحدات متوفرة

source: You cannot return items when creating a bill.
ar: لا يمكنك إرجاع العناصر عند إنشاء فاتورة.

source: Not enough {name} units to return
ar: لا تكفي {name} وحدات للارجاع

source: Duplicate items detected
ar: تم اكتشاف عناصر مكررة

source: Material must be identified by an integer ID.
ar: يجب تحديد الخامات بواسطة ID عدد صحيح.

source: consumption can not be negative.
ar: الاستهلاك لا يمكن أن يكون عدد سلبي.

source: You Can not access a material from another branch
ar: لا يمكنك الوصول إلى خامات من فرع آخر

source: You Can not access a Product from another branch
ar: لا يمكنك الوصول إلى منتج من فرع آخر

source: Warning Units can not be negative.
ar: وحدات التحذير لا يمكن أن تكون عدد سلبي.

source: Price can not be negative or equal to zero.
ar: لا يمكن أن يكون السعر عدد سلبي أو يساوي الصفر.

source: You can not add a product to this branch
ar: لا يمكنك إضافة منتج إلى هذا الفرع

source: Materials must be provided.
ar: يجب ادراج الخامات.

source: You tried to add the same material more than once
ar: حاولت إضافة نفس الخامات أكثر من مرة

source: This material is not valid for this branch
ar: هذه الخامات غير صالحة لهذا الفرع

source: Salary can not be negative or equal to zero.
ar: لا يمكن أن يكون الراتب عدد سلبي أو يساوي الصفر.

source: Allowed Absence Days value cannot be larger than 31
ar: لا يمكن أن تكون قيمة أيام الغياب المسموح بها أكبر من 31

source: Shift Hours value cannot be larger than 12 hour
ar: لا يمكن أن تكون قيمة ساعات العمل أكبر من 12 ساعة

source: You Do not have the permission to assign staff to another branch
ar: ليس لديك إذن لتعيين الموظفين إلى فرع آخر

source: You Do not have the permission edit the branch field
ar: ليس لديك إذن تعديل حقل الفرع

source: Branch must be provided
ar: يجب ادراج الفرع

source: You Do not have the permission to manipulate other branches staff
ar: ليس لديك إذن للتلاعب بموظفي الفروع الآخرين

source: Invalid staff ID.
ar: ID الموظفين غير صالح.

source: You must provide a valid staff ID.
ar: يجب عليك تقديم ID الموظفين صالحين.

source: staff must be identified by an integer ID.
ar: يجب تحديد الموظفين من خلال ID عدد صحيح.

source: Withdraw value can not be negative or equal to zero
ar: لا يمكن أن تكون قيمة المسحوبات سالبة أو تساوي الصفر

source: You can not add a withdraw to this staff member
ar: لا يمكنك إضافة مسحوبات إلى هذا الموظف

source: You can not update a staff withdraw from another branch
ar: لا يمكنك تعديل مسحوبات الموظفين من فرع آخر

source: Fine days value must be above zero and below 10
ar: يجب أن تكون قيمة ايام الغرامة أعلى من الصفر وأقل من 10

source: You can not add a fine to this staff member
ar: لا يمكنك إضافة غرامة إلى هذا الموظف

source: You can not update a staff fine from another branch
ar: لا يمكنك تحديث غرامة الموظفين من فرع آخر

source: Over Time value can not be negative
ar: لا يمكن أن تكون قيمة الاوفر تايم عدد سلبي

source: Minus Time value can not be negative
ar: قيمة الداون تايم لا يمكن أن تكون عدد سلبي

source: Delay Time value can not be negative
ar: لا يمكن أن تكون قيمة وقت التأخير عدد سلبي

source: Absence Days value can not be negative or above 30
ar: لا يمكن أن تكون قيمة أيام الغياب عدد سلبي أو أعلى من 30

source: Bonus value can not be negative
ar: لا يمكن أن تكون قيمة البونص عدد سلبي

source: You can not add a salary to this staff member
ar: لا يمكنك إضافة راتب إلى هذا الموظف

source: You can not update a staff salary from another branch
ar: لا يمكنك تحديث راتب الموظفين من فرع آخر

source: Subscription Hours Invalid value
ar: قيمة ساعات غير صالحة للاشتراك

source: Subscription Duration value must be more than or equal to 7 days
ar: يجب أن تكون قيمة مدة الاشتراك أكثر من أو تساوي 7 أيام

source: Subscription Price value can not be negative
ar: لا يمكن أن تكون قيمة سعر الاشتراك عدد سلبي

source: Invalid subscription ID.
ar: ID الاشتراك غير صالح.

source: You must provide a valid subscription ID.
ar: يجب عليك تقديم ID اشتراك صالح.

source: subscription must be identified by an integer ID.
ar: يجب تحديد الاشتراك بواسطة ID عدد صحيح.

source: You can not create a subscription with a different branch
ar: لا يمكنك إنشاء اشتراك مع فرع مختلف

source: This child already has an active subscription
ar: هذا الطفل لديه بالفعل اشتراك نشط

source: The money Paid does not equal the price of the subscription
ar: الأموال المدفوعة لا تساوي سعر الاشتراك

source: Selected branch does not exist.
ar: الفرع المختار غير موجود.

source: Invalid Staff ID.
ar: ID الموظفين غير صالح.

source: Selected Staff does not exist.
ar: الموظفين المختارين غير موجود.

source: Staff must be identified by an integer ID.
ar: يجب تحديد الموظفين من خلال ID عدد صحيح.

source: You Can not access a user from another branch
ar: لا يمكنك الوصول إلى مستخدم من فرع آخر

source: incorrect role
ar: رتبة غير صالحة

source: Passwords do not match
ar: كلمات المرور لا تتطابق

source: You can not give a user a role higher or equal to yours
ar: لا يمكنك إعطاء المستخدم رتبة أعلى أو مساويًا لك

source: Branch can not be null for the given role
ar: لا يمكن أن يكون الفرع فارغًا للرتبة المعطاة

source: Branch must have a value
ar: يجب أن يكون للفرع قيمة

source: You can not give a user with a role higher or equal to yours
ar: لا يمكنك إعطاء مستخدم له رتبة أعلى أو مساوٍ لك

source: An error occurred
ar: حدث خطأ

source: You have been logged out successfully.
ar: لقد تم تسجيل الدخول بنجاح.

source: Valid Refresh Token is Required
ar: مطلوب Refresh Token صالح

source: Bill Created successfully
ar: تم انشاء الفاتورة بنجاح

source: Wrong data for closing the bill
ar: بيانات خاطئة لإغلاق الفاتورة

source: Bill Closed successfully
ar: تم اغلاق الفاتورة بنجاح

source: Values must be in Decimal formal
ar: يجب أن تكون القيم في عشرية رسمية

source: The bill is still active, You can not update it right now
ar: لا تزال الفاتورة نشطة ، لا يمكنك تحديثها الآن

source: Discount must be provided
ar: يجب ادراج الخصم

source: Discount Applied successfully
ar: تم تطبيق الخصم بنجاح

source: You do not have the permission to access this data
ar: ليس لديك إذن للوصول إلى هذه البيانات

source: Branch Created successfully
ar: تم انشاء الفرع بنجاح

source: Branch Updated successfully
ar: تم تحديث الفرع بنجاح

source: Child Created successfully
ar: تم تسجيل الطفل بنجاح

source: Child Updated successfully
ar: تم تحديث الطفل بنجاح

source: Discount Created successfully
ar: الخصم تم إنشاؤه بنجاح

source: Discount Updated successfully
ar: الخصم تم تحديثه بنجاح

source: GeneralExpense Created successfully
ar: تم انشاء مصروفات عامة بنجاح

source: GeneralExpense Updated successfully
ar: تم تحديث المصروفات العامة بنجاح

source: MaterialExpense Created successfully
ar: تم إنشاء مصروفات الخامات بنجاح

source: MaterialExpense Updated successfully
ar: تم تحديث مصروفات الخامات بنجاح

source: Material Created successfully
ar: الخامات التي تم إنشاؤها بنجاح

source: Material Updated successfully
ar: تم تحديث الخامات بنجاح

source: Material added to branch successfully
ar: تم اضافة الخامات الي الفرع بنجاح

source: Material Branch data Updated successfully
ar: تم تحديث بيانات خامات الفرع بنجاح

source: Offer Created successfully
ar: العرض تم إنشاؤه بنجاح

source: Offer Updated successfully
ar: العرض تحديث بنجاح

source: Offer added to branch successfully
ar: العرض تم اضافته إلى الفرع بنجاح

source: Offer branch data Updated successfully
ar: تم تعديل بيانات عروض الفرع بنجاح

source: Cafe Bill Created successfully
ar: تم إنشاء فاتورة الكافيه بنجاح

source: Cafe Bill Updated successfully
ar: تم تحديث فاتورة الكافيه بنجاح

source: Product Created successfully
ar: تم إنشاء المنتج بنجاح

source: Product Updated successfully
ar: تم تحديث المنتج بنجاح

source: Product added to branch successfully
ar: تمت إضافة المنتج إلى الفرع بنجاح

source: Product branch data Updated successfully
ar: تم تحديث بيانات منتجات الفرع بنجاح

source: School Created successfully
ar: أنشأت المدرسة بنجاح

source: School Updated successfully
ar: تم تحديث المدرسة بنجاح

source: Schools File Created Successfully
ar: تم إنشاء ملف المدارس بنجاح

source: Staff Created successfully
ar: أنشأ الموظفون بنجاح

source: Staff Updated successfully
ar: تم تحديث الموظفين بنجاح

source: StaffWithdraw Created successfully
ar: تم إنشاء مسحوبات الموظف بنجاح

source: StaffWithdraw Updated successfully
ar: تم تحديث مسحوبات الموظف بنجاح

source: StaffFine Created successfully
ar: أنشأت غرامة الموظف بنجاح

source: StaffFine Updated successfully
ar: تم تحديث غرامة الموظف بنجاح

source: StaffSalary Created successfully
ar: تم إنشاء راتب الموظف بنجاح

source: StaffSalary Updated successfully
ar: تحديث راتب الموظف بنجاح

source: Subscription Created successfully
ar: تم إنشاء الاشتراك بنجاح

source: Subscription Updated successfully
ar: تم تحديث الاشتراك بنجاح

source: SubscriptionInstance Created successfully
ar: تم إنشاء اشتراك للطفل بنجاح

source: SubscriptionInstance Updated successfully
ar: تم تحديث اشتراك للطفل بنجاح

source: User Created Successfully
ar: تم إنشاء المستخدم بنجاح

source: User Updated successfully
ar: تم تحديث المستخدم بنجاح
